test/request-response-samples/Message__overriding_namespace_prefix/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:s0="urn:MessageService" xmlns:s1="urn:MessageService2" xmlns:atls="http://tempuri.org/vc/atl/server/"><soap:Body><s0:Message><s1:bstrResourceId>034b7ea5-8a04-11e3-9710-0050569575d8</s1:bstrResourceId></s0:Message></soap:Body></soap:Envelope>